# Siddharth Shanbhogue's BrewFile for Mac based development environment
# specify a directory to install
cask_args appdir: '/Applications'

## APPLICATIONS & PLUGINS

tap 'homebrew/cask' || true 
tap "homebrew/homebrew-cask-fonts"

## QUICKLOOK PLUGINS FOR FILE-CONTENT VIEWING
cask "betterzip"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "cert-quicklook"
cask "quicklook-json"

## SOURCE CODE MANAGEMENT

# Git
brew 'git'

## SHELLS & ENVIRONMENT RELATED

# Z-shell
brew 'zsh'

# Zsh Plugins for easier command line experience
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# iterm
cask 'iterm2'

# gpg ssh 
brew 'gpg'

# tree - recursive directory listing command
brew 'tree'

# NCDU - ncurses based Disk usage tool
brew 'ncdu'

# Zlib and other essential packages
brew 'zlib'
brew 'bzip2'
brew 'openssl' 
brew 'readline'
brew 'sqlite3'
brew 'xz'

# NVM - A version manager for NodeJS
brew 'nvm'

# Neovim - better VIM editor
tap 'neovim/neovim' || true
brew 'neovim'

# tmux - Terminal MUltipleXer
brew 'tmux'

# wget
brew 'wget'

# TLDR - simpler man pages
brew 'tldr'

## TOOLS FOR BETTER MAC EXPERIENCE

# Google Drive 
cask 'google-backup-and-sync'

# Google Chrome 
cask 'google-chrome'

# Alfred - better search and indexing in macOS
cask 'alfred'

# Speedtest
brew 'speedtest-cli'

# App Cleaner
cask 'appcleaner'

# Caffeine - Utility that prevents the system from going to sleep
cask 'caffeine'

# Cheatsheet - Tool to list all active shortcuts of the current application
cask 'cheatsheet'

# Blockblock - A CLI workflow for the administration of macOS applications distributed as binaries
cask 'blockblock'

# KnockKnock. Tool to show what is persistently installed on the computer
cask 'knockknock'

## FONTS 

# Font-hack
cask 'font-hack'

# Sourcecode pro
cask 'font-source-code-pro'

## COMMUNICATION RELATED

# Slack
cask 'slack'

# Textual - IRC Client
cask 'textual'

# Telegram App
cask 'telegram'

# Discord App
cask 'discord'

## MULTIMEDIA RELATED

# VLC
cask 'vlc'

# Youtube DL
brew 'youtube-dl'

## PROGRAMMING ENVIRONMENT

# TiddlyWiki
cask 'tiddly'

# virtual environment
brew 'pyenv' 
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'

# Insomnia - API tool
cask 'insomnia'

# JQ - Json Query
brew  'jq'

# dash - api documentation browser and code snippet manager
cask 'dash'

## CODE EDITORS

# VSCode
cask 'visual-studio-code'

# vim
brew 'vim'

# nano
brew 'nano'

# Macdown - Markdown editor for developers
cask 'macdown'

